Public Attributes | List of all members
API_IFCDifferenceGeneratorState Struct Reference
IFC
State used in IFCDifference Generator. More...
#include <APIdefs_IFC.h>
 Public Attributes
 API_ElemDifferenceGeneratorState  | elemDifferenceGeneratorState
Element Difference Generator state.
 API_Guid  | environmentChecksum
Environment checksum calculated from IFC Translator name, IFC Translator settings, IfcBuildingStorey core data, etc.
 API_IFCRelationshipData  | ifcRelationshipData
IFC Relationship Data.
 GS::HashTable< API_Guid, API_Guid >  | elementIDToIFCGlobalId
ArchiCAD Guid and IFC Global Id table.
Detailed Description
State used in IFCDifference Generator.
Since
Archicad 26